"use client"
import './Reviews.scss';
import { useEffect, useState,useContext } from "react";
import { Swiper, SwiperSlide } from 'swiper/react';
import { Navigation } from 'swiper/modules';
import Link from 'next/link';
import Image from 'next/image';

import 'swiper/css';
import 'swiper/css/navigation';


export default function Reviews() {
    
    const items = [
        { id: '1', name: 'Диана Тараканова', rank: 5, date: '18 июня 2025', text: 'Наши подушки хорошо работают , используем как в надувном шоу , так и в отдельных программах иногда. А еще у нас был человечек надувной в подарок , он сподвиг нас купить и остальные подушки😀' },
        { id: '2', name: 'Ксения Фридель', rank: 5, date: '28 мая 2025', text: 'Просто 100 из 100 ! От клиентоориентированности до самого крутого продукта ! Помогли с выбором ,наполнением ,ответили на все вопросы и все в товары в наличии ! Вы большие молодцы ! Процветания и больше идей' },
        { id: '3', name: 'Анастасия Немтинова', rank: 5, date: '23 апреля 2025', text: 'Прекрасное шоу это просто хит на всех летних вечеринках и на только )) дети в восторге ) спасибо за оперативное изготовление нашего заказа. Планируем заказывать у вас дальше летнюю коллекцию !' },
        { id: '4', name: 'Наталья Субратова', rank: 5, date: '23 марта 2025', text: 'Просто супер👍,большое спасибо🙂 качество огонь 🔥,яркий,красивый пряник !' },
        { id: '5', name: 'Дмитрий Захаров', rank: 5, date: '3 марта 2025', text: 'Здравствуйте спасибо вам за Надувное шоу это просто пушка бомба 💥 классно весело просто супер 👍🏻' },
        { id: '6', name: 'Виктория Чайкова', rank: 5, date: '15 февраля 2025', text: 'Купили шоу, пока мы всем довольны, надеемся так будет и дальше ❤' },
        { id: '7', name: 'Соня Антипенко', rank: 5, date: '14 февраля 2025', text: 'Офигенная Лапка! Отличное качество, яркие цвета, плотная молния, все швы очень качественные, дети от неё балдеют)) Отдельно рекомендую заказать вместе с моторчиком, с ним вообще песня, не надо ничего поддувать, она всегда остается в надутом состоянии))' },
        { id: '8', name: 'Оленька Шабунина', rank: 5, date: '14 февраля 2025', text: 'Подушки просто бомба ,цвета отвал башки 🤪❤❤❤Провели уже первый праздник дети просто в восторге! Отдельное спасибо руководителю,за обратную связь ❤оне всегда на связи 🌸' },
        { id: '9', name: 'Зарина Алтынбаева', rank: 5, date: '11 февраля 2025', text: 'Заказывала таба лапку, отправили оперативно, еще и приятный подарок положили!❤ Подушка качественная и яркая! Рекомендую!🔥🔥🔥' },
        { id: '10', name: 'Надежда Кондратьева', rank: 5, date: '11 февраля 2025', text: 'Приобрели комплект " Гигантские летающие подушки". Яркие,качественно изготовленные,многофункциональные и для всех возрастов посетителей нашего центра. Уже надували.Хорошая герметизация. ждём праздника и стартуем!!!' },
    ];

    return (    
        <div className="reviews">
            <h2>Отзывы наших счастливых подушечников</h2>
            <Swiper
                slidesPerView={'auto'}
                spaceBetween={30}
                navigation={{
                    nextEl: ".swiper-button-next-new",
                    prevEl: ".swiper-button-prev-new",
                }}
                modules={[Navigation]}
                className="reviews-slider"
                loop='true'  
            >
                {items.map(item => (
                    <SwiperSlide key={item.id}>
                        <div className='profile'>
                            <div className='rank'>
                                <strong>{item.name}</strong>
                                <p>{item.date}</p>
                                <div className='star'>
                                    <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M31.0386 12.0689L22.3603 10.8076L18.481 2.94288C18.375 2.72755 18.2007 2.55324 17.9853 2.44728C17.4453 2.18068 16.7891 2.40284 16.519 2.94288L12.6396 10.8076L3.96142 12.0689C3.72216 12.103 3.50341 12.2158 3.33593 12.3867C3.13346 12.5948 3.02189 12.8748 3.02573 13.1651C3.02958 13.4555 3.14853 13.7324 3.35644 13.9351L9.63525 20.0567L8.15185 28.7007C8.11706 28.9018 8.13932 29.1086 8.21608 29.2977C8.29285 29.4867 8.42105 29.6505 8.58617 29.7704C8.75128 29.8904 8.94669 29.9616 9.15024 29.9761C9.35379 29.9906 9.55733 29.9478 9.73779 29.8526L17.5 25.7715L25.2622 29.8526C25.4741 29.9653 25.7202 30.0029 25.9561 29.9619C26.5508 29.8594 26.9507 29.2954 26.8481 28.7007L25.3647 20.0567L31.6436 13.9351C31.8144 13.7676 31.9272 13.5488 31.9614 13.3096C32.0537 12.7114 31.6367 12.1577 31.0386 12.0689Z" fill="url(#paint0_linear_327_216)"/>
                                        <defs>
                                        <linearGradient id="paint0_linear_327_216" x1="17.4999" y1="2.33447" x2="17.4999" y2="29.9789" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#E85E8F"/>
                                        <stop offset="1" stopColor="#EF286F"/>
                                        </linearGradient>
                                        </defs>
                                    </svg>
                                    <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M31.0386 12.0689L22.3603 10.8076L18.481 2.94288C18.375 2.72755 18.2007 2.55324 17.9853 2.44728C17.4453 2.18068 16.7891 2.40284 16.519 2.94288L12.6396 10.8076L3.96142 12.0689C3.72216 12.103 3.50341 12.2158 3.33593 12.3867C3.13346 12.5948 3.02189 12.8748 3.02573 13.1651C3.02958 13.4555 3.14853 13.7324 3.35644 13.9351L9.63525 20.0567L8.15185 28.7007C8.11706 28.9018 8.13932 29.1086 8.21608 29.2977C8.29285 29.4867 8.42105 29.6505 8.58617 29.7704C8.75128 29.8904 8.94669 29.9616 9.15024 29.9761C9.35379 29.9906 9.55733 29.9478 9.73779 29.8526L17.5 25.7715L25.2622 29.8526C25.4741 29.9653 25.7202 30.0029 25.9561 29.9619C26.5508 29.8594 26.9507 29.2954 26.8481 28.7007L25.3647 20.0567L31.6436 13.9351C31.8144 13.7676 31.9272 13.5488 31.9614 13.3096C32.0537 12.7114 31.6367 12.1577 31.0386 12.0689Z" fill="url(#paint0_linear_327_216)"/>
                                        <defs>
                                        <linearGradient id="paint0_linear_327_216" x1="17.4999" y1="2.33447" x2="17.4999" y2="29.9789" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#E85E8F"/>
                                        <stop offset="1" stopColor="#EF286F"/>
                                        </linearGradient>
                                        </defs>
                                    </svg>
                                    <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M31.0386 12.0689L22.3603 10.8076L18.481 2.94288C18.375 2.72755 18.2007 2.55324 17.9853 2.44728C17.4453 2.18068 16.7891 2.40284 16.519 2.94288L12.6396 10.8076L3.96142 12.0689C3.72216 12.103 3.50341 12.2158 3.33593 12.3867C3.13346 12.5948 3.02189 12.8748 3.02573 13.1651C3.02958 13.4555 3.14853 13.7324 3.35644 13.9351L9.63525 20.0567L8.15185 28.7007C8.11706 28.9018 8.13932 29.1086 8.21608 29.2977C8.29285 29.4867 8.42105 29.6505 8.58617 29.7704C8.75128 29.8904 8.94669 29.9616 9.15024 29.9761C9.35379 29.9906 9.55733 29.9478 9.73779 29.8526L17.5 25.7715L25.2622 29.8526C25.4741 29.9653 25.7202 30.0029 25.9561 29.9619C26.5508 29.8594 26.9507 29.2954 26.8481 28.7007L25.3647 20.0567L31.6436 13.9351C31.8144 13.7676 31.9272 13.5488 31.9614 13.3096C32.0537 12.7114 31.6367 12.1577 31.0386 12.0689Z" fill="url(#paint0_linear_327_216)"/>
                                        <defs>
                                        <linearGradient id="paint0_linear_327_216" x1="17.4999" y1="2.33447" x2="17.4999" y2="29.9789" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#E85E8F"/>
                                        <stop offset="1" stopColor="#EF286F"/>
                                        </linearGradient>
                                        </defs>
                                    </svg>
                                    <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M31.0386 12.0689L22.3603 10.8076L18.481 2.94288C18.375 2.72755 18.2007 2.55324 17.9853 2.44728C17.4453 2.18068 16.7891 2.40284 16.519 2.94288L12.6396 10.8076L3.96142 12.0689C3.72216 12.103 3.50341 12.2158 3.33593 12.3867C3.13346 12.5948 3.02189 12.8748 3.02573 13.1651C3.02958 13.4555 3.14853 13.7324 3.35644 13.9351L9.63525 20.0567L8.15185 28.7007C8.11706 28.9018 8.13932 29.1086 8.21608 29.2977C8.29285 29.4867 8.42105 29.6505 8.58617 29.7704C8.75128 29.8904 8.94669 29.9616 9.15024 29.9761C9.35379 29.9906 9.55733 29.9478 9.73779 29.8526L17.5 25.7715L25.2622 29.8526C25.4741 29.9653 25.7202 30.0029 25.9561 29.9619C26.5508 29.8594 26.9507 29.2954 26.8481 28.7007L25.3647 20.0567L31.6436 13.9351C31.8144 13.7676 31.9272 13.5488 31.9614 13.3096C32.0537 12.7114 31.6367 12.1577 31.0386 12.0689Z" fill="url(#paint0_linear_327_216)"/>
                                        <defs>
                                        <linearGradient id="paint0_linear_327_216" x1="17.4999" y1="2.33447" x2="17.4999" y2="29.9789" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#E85E8F"/>
                                        <stop offset="1" stopColor="#EF286F"/>
                                        </linearGradient>
                                        </defs>
                                    </svg>
                                    <svg width="35" height="35" viewBox="0 0 35 35" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M31.0386 12.0689L22.3603 10.8076L18.481 2.94288C18.375 2.72755 18.2007 2.55324 17.9853 2.44728C17.4453 2.18068 16.7891 2.40284 16.519 2.94288L12.6396 10.8076L3.96142 12.0689C3.72216 12.103 3.50341 12.2158 3.33593 12.3867C3.13346 12.5948 3.02189 12.8748 3.02573 13.1651C3.02958 13.4555 3.14853 13.7324 3.35644 13.9351L9.63525 20.0567L8.15185 28.7007C8.11706 28.9018 8.13932 29.1086 8.21608 29.2977C8.29285 29.4867 8.42105 29.6505 8.58617 29.7704C8.75128 29.8904 8.94669 29.9616 9.15024 29.9761C9.35379 29.9906 9.55733 29.9478 9.73779 29.8526L17.5 25.7715L25.2622 29.8526C25.4741 29.9653 25.7202 30.0029 25.9561 29.9619C26.5508 29.8594 26.9507 29.2954 26.8481 28.7007L25.3647 20.0567L31.6436 13.9351C31.8144 13.7676 31.9272 13.5488 31.9614 13.3096C32.0537 12.7114 31.6367 12.1577 31.0386 12.0689Z" fill="url(#paint0_linear_327_216)"/>
                                        <defs>
                                        <linearGradient id="paint0_linear_327_216" x1="17.4999" y1="2.33447" x2="17.4999" y2="29.9789" gradientUnits="userSpaceOnUse">
                                        <stop stopColor="#E85E8F"/>
                                        <stop offset="1" stopColor="#EF286F"/>
                                        </linearGradient>
                                        </defs>
                                    </svg>
                                </div>
                            </div>
                        </div>
                            <div className='review'>
                                {item.text}
                            </div>
                    </SwiperSlide>
                ))}
                <button className="swiper-button-prev-new"></button>
                <button className="swiper-button-next-new"></button>
            </Swiper>
        </div>
    )
}